package ru.gpbapp.datafirewallflink.rule;

import java.util.Map;
import java.util.Set;
import java.util.stream.Collectors;
import java.util.stream.Stream;

public final class RulePlan {

    private RulePlan() {}

    private static Set<String> r(String... ids) {
        return Stream.of(ids)
                .map(id -> "Rule" + id)
                .collect(Collectors.toUnmodifiableSet());
    }

    public static final Map<String, Set<String>> FIELD_TO_RULES = Map.ofEntries(

            Map.entry("АДРЕС.Страна", r("1164","1169")),
            Map.entry("АДРЕС.Район", r("1194")),
            Map.entry("АДРЕС.Код страны", r("1193","1192")),
            Map.entry("АДРЕС.Населенный пункт", r("1166","10198","10196")),
            Map.entry("АДРЕС.Улица", r("10213","10189","10188")),
            Map.entry("АДРЕС.Почтовый индекс", r("1099","1098")),
            Map.entry("АДРЕС.Наименование города", r("1094","1096","1097","1095","1144")),

            Map.entry("КОНТАКТ.Телефон.Номер телефона", r("1146","1178","1196")),
            Map.entry("КОНТАКТ.Почта.Электронный адрес (email)", r("1174")),

            Map.entry("ГРАЖДАНСТВО.Страна", r("10148","1085")),

            Map.entry("ИНН.Номер свидетельства", r("1092","1093","1086")),

            Map.entry("ОСНОВНЫЕ СВЕДЕНИЯ.СНИЛС", r("1180","1135","1182","1080","1181")),
            Map.entry("ОСНОВНЫЕ СВЕДЕНИЯ.Имя", r("1070","1068","1066","1069","10192")),
            Map.entry("ОСНОВНЫЕ СВЕДЕНИЯ.Фамилия", r("10328","1081","1083","10121","1084")),
            Map.entry("ОСНОВНЫЕ СВЕДЕНИЯ.Отчество", r("1162","1078","1076","10194","10067")),
            Map.entry("ОСНОВНЫЕ СВЕДЕНИЯ.Дата рождения", r("1158","10185","1148","10127")),
            Map.entry("ОСНОВНЫЕ СВЕДЕНИЯ.Место рождения", r("1161","1075","1073","1072","1074")),
            Map.entry("ОСНОВНЫЕ СВЕДЕНИЯ.Пол", r("1079")),
            Map.entry("ОСНОВНЫЕ СВЕДЕНИЯ.ФИО одной строкой", r("1091","1087","1090","1088","1175")),
            Map.entry("ОСНОВНЫЕ СВЕДЕНИЯ.Дата смерти", r("1065")),

            Map.entry("ДУЛ.Паспорт РФ.Номер", r("1107","10184")),
            Map.entry("ДУЛ.Паспорт РФ.Серия", r("10220","1109","1112")),
            Map.entry("ДУЛ.Паспорт РФ.Кем выдан", r("1108","1165","10201","1110","1179")),
            Map.entry("ДУЛ.Паспорт РФ.Дата выдачи", r("10133","10244","10132","10135","10134","1103")),
            Map.entry("ДУЛ.Паспорт РФ.Код подразделения", r("1106","1105","1104"))

            // остальные записи оставь аналогично
    );
}